KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТКач_ПечатьРезультатИспытания/КАНАТКач_ПечатьРезультатИспытания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТКач_ПечатьРезультатИспытания</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/КАНАТ_ЛицаПодписывающиеЗаПодразделения/КАНАТ_ЛицаПодписывающиеЗаПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КАНАТ_ЛицаПодписывающиеЗаПодразделения</name>
  <dimensions>
    <name>РольРуководителя</name>
    <type>
      <types>EnumRef.КАНАТ_РолиПодписантов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Замещающий</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТ_РолиПодписантов/КАНАТ_РолиПодписантов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТ_РолиПодписантов</name>
  <enumValues>
    <name>РуководительЛаборатории</name>
  </enumValues>
  <enumValues>
    <name>РуководительТехОтдела</name>
  </enumValues>
  <enumValues>
    <name>РуководительОУКП</name>
  </enumValues>
  <enumValues>
    <name>СтОператорЭВМ</name>
  </enumValues>
  <enumValues>
    <name>ТехникЛаборант</name>
  </enumValues>
  <enumValues>
    <name>ГенДиректор</name>
  </enumValues>
  <enumValues>
    <name>ВедИнженерТехнолог</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/КАНАТ_РезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РезультатИспытаний</name>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НТДПродукции</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Структура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПартияГотовойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьФакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГотовойПродукцииИспытания</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаИМетодикаИспытаний</name>
    <type>
      <types>CatalogRef.КАНАТ_ПрограммаИМетодикаИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСырье</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СырьеДляПечатнойФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырья</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НТДСырья</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияСырья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПримечаниеПоСырью</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьВПФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_СертификатКачества/КАНАТ_СертификатКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_СертификатКачества</name>
  <basedOn>Document.КАНАТ_РезультатИспытаний</basedOn>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.КАНАТ_РезультатИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТКач_ПечатьРезультатИспытания/ManagerModule.bsl
//++ Гурьев 10.10.23 ЧТЗ_К3
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПротоколРезультатовИспытаний") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПротоколРезультатовИспытаний",
				"Протокол результатов испытаний",
				СформироватьПечатнуюФорму(Документ, "ПротоколРезультатовИспытаний"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПротоколРезультатовИспытанийДляМорскогоРегистра") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПротоколРезультатовИспытанийДляМорскогоРегистра",
				"Протокол результатов испытаний для морского регистра",
				СформироватьПечатнуюФорму(Документ, "ПротоколРезультатовИспытанийДляМорскогоРегистра"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОтбораОбразцов") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"АктОтбораОбразцов",
				"Акт отбора образцов",
				СформироватьПечатнуюФорму(Документ, "АктОтбораОбразцов"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатКачества") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"СертификатКачества",
				"Сертификат качества",
				СформироватьПечатнуюФорму(Документ, "СертификатКачества"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатКачестваМЧС") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"СертификатКачестваМЧС",
				"Сертификат качества Страховочно-Спасательного со знаком МЧС",
				СформироватьПечатнуюФорму(Документ, "СертификатКачестваМЧС"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатКачестваБезМЧС") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"СертификатКачестваБезМЧС",
				"Сертификат качества Страховочно-Спасательного без знака МЧС",
				СформироватьПечатнуюФорму(Документ, "СертификатКачестваБезМЧС"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатКачестваРМРС") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"СертификатКачестваРМРС",
				"Сертификат качества для Российского Морского Регистра Судоходства",
				СформироватьПечатнуюФорму(Документ, "СертификатКачестваРМРС"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатКачестваРРР") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"СертификатКачестваРРР",
				"Сертификат качества для Речного Регистра (РРР)",
				СформироватьПечатнуюФорму(Документ, "СертификатКачестваРРР"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатКачестваРКО") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"СертификатКачестваРКО",
				"Сертификат качества для Российского Классификационного Общества (РКО)",
				СформироватьПечатнуюФорму(Документ, "СертификатКачестваРКО"));
			КонецЕсли;
			
			//++Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка. 
			Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МорскойРегистрСудоходства") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"МорскойРегистрСудоходства",
				"Морской Регистр Судоходства",
				СформироватьПечатнуюФорму(Документ, "МорскойРегистрСудоходства"));
		    КонецЕсли;
		    //--Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
		
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры
//-- Гурьев 10.10.23 

//++ Гурьев 10.10.23 ЧТЗ_К3
//Формирует печатную форму по реквизиту НазваниеПФ
//Сначала получаются области из нужной печатной формы, дальше получаются данные ПФ
//Т.к. печатные формы схожи, данные получаются одинаковые для всех печатных форм (нек . данные могут быть лишними)
//Далее полученные области выводятся и заполняются из общих данных
Функция СформироватьПечатнуюФорму(Документ, НазваниеПФ)
	
	Табдок = Новый ТабличныйДокумент;
	Табдок.АвтоМасштаб = Истина;
	
	СтруктураОбластей = ПолучитьСтруктуруОбластей(НазваниеПФ, Табдок, Документ);
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КАНАТ_СертификатКачества") Тогда
	ДанныеПФ = получитьДанныеСертефикатаКачества(Документ);
	Иначе
	ДанныеПФ = ПолучитьДанныеПФ(Документ);	
	КонецЕсли;
	//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	Если СтруктураОбластей.Свойство("ОбластьШапка") Тогда
		
		СтруктураОбластей.ОбластьШапка.Параметры.Заполнить(ДанныеПФ);
		Табдок.Вывести(СтруктураОбластей.ОбластьШапка);
		
	КонецЕсли;
	
	Если СтруктураОбластей.Свойство("ОбластьТаблицаШапка") Тогда
		
		СтруктураОбластей.ОбластьТаблицаШапка.Параметры.Заполнить(ДанныеПФ);
		Табдок.Вывести(СтруктураОбластей.ОбластьТаблицаШапка);
		
	КонецЕсли;
	
	Если СтруктураОбластей.Свойство("ОбластьТаблицаСтрока") Тогда
		//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.КАНАТ_СертификатКачества") Тогда
		ЗаполнитьВывестиТаблицуПоказателейСертефикатКачества(Табдок, СтруктураОбластей.ОбластьТаблицаСтрока, Документ);	
		Иначе
		ЗаполнитьВывестиТаблицуПоказателей(Табдок, СтруктураОбластей.ОбластьТаблицаСтрока, Документ);
		конецЕсли;
		//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	КонецЕсли;
	
	Если СтруктураОбластей.Свойство("ОбластьТаблицаСырье") Тогда
		
		СтруктураОбластей.ОбластьТаблицаСырье.Параметры.Заполнить(ДанныеПФ);
		Табдок.Вывести(СтруктураОбластей.ОбластьТаблицаСырье);
		
	КонецЕсли;
	
	Если СтруктураОбластей.Свойство("ОбластьТаблицаПодвал") Тогда
		
		СтруктураОбластей.ОбластьТаблицаПодвал.Параметры.Заполнить(ДанныеПФ);
		Табдок.Вывести(СтруктураОбластей.ОбластьТаблицаПодвал);
		
	КонецЕсли;
	
	Если СтруктураОбластей.Свойство("ОбластьПодвал") Тогда
		
		СтруктураОбластей.ОбластьПодвал.Параметры.Заполнить(ДанныеПФ);
		Табдок.Вывести(СтруктураОбластей.ОбластьПодвал);
		
	КонецЕсли;
	Возврат Табдок;
	
КонецФункции
//-- Гурьев 10.10.23 

//++ Гурьев 11.10.23 ЧТЗ_К3
Функция ПолучитьСтруктуруОбластей(НазваниеПФ, Табдок, Документ)
	
	СтруктураОбластей = Новый Структура;
	
	Если НазваниеПФ = "ПротоколРезультатовИспытаний" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_ПротоколРезультатовИспытаний");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
		
	ИначеЕсли НазваниеПФ = "ПротоколРезультатовИспытанийДляМорскогоРегистра" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_ПротоколРезультатовИспытанийДляМорскогоРегистра");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
		
	ИначеЕсли НазваниеПФ = "АктОтбораОбразцов" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_АктОтбораОбразцов");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСверху = 15;
		Табдок.ПолеСлева  = 20;
		Табдок.ПолеСправа = 20;
		
	ИначеЕсли НазваниеПФ = "СертификатКачества" Тогда
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.КАНАТ_РезультатИспытаний") 
			И Документ.ВидГотовойПродукцииИспытания.Наименование = "Сетематериалы" Тогда
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_СертификатКачестваСетематериалы"); 
			
		Иначе
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_СертификатКачества");
			
		КонецЕсли;
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьТаблицаПодвал", Макет.ПолучитьОбласть("ОбластьТаблицаПодвал"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
		Табдок.ПолеСверху = 0;
		Табдок.ПолеСнизу = 0;
		Табдок.КоличествоЭкземпляров = 2;
		Табдок.ЭкземпляровНаСтранице = 2;
		
	ИначеЕсли НазваниеПФ = "СертификатКачестваМЧС" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_СертификатКачестваМЧС");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСырье",  Макет.ПолучитьОбласть("ОбластьТаблицаСырье"));
		СтруктураОбластей.Вставить("ОбластьТаблицаПодвал", Макет.ПолучитьОбласть("ОбластьТаблицаПодвал"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
		
	ИначеЕсли НазваниеПФ = "СертификатКачестваБезМЧС" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_СертификатКачестваБезМЧС");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСырье",  Макет.ПолучитьОбласть("ОбластьТаблицаСырье"));
		СтруктураОбластей.Вставить("ОбластьТаблицаПодвал", Макет.ПолучитьОбласть("ОбластьТаблицаПодвал"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
		
	ИначеЕсли НазваниеПФ = "СертификатКачестваРМРС" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_СертификатКачестваРМРС");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьТаблицаПодвал", Макет.ПолучитьОбласть("ОбластьТаблицаПодвал"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
		
	ИначеЕсли НазваниеПФ = "СертификатКачестваРРР" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_СертификатКачестваРРР");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьТаблицаПодвал", Макет.ПолучитьОбласть("ОбластьТаблицаПодвал"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
		
	ИначеЕсли НазваниеПФ = "СертификатКачестваРКО" Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_СертификатКачестваРКО");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьТаблицаПодвал", Макет.ПолучитьОбласть("ОбластьТаблицаПодвал"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));
		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;
	//++Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.	
	ИначеЕсли НазваниеПФ = "МорскойРегистрСудоходства" Тогда
		  Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ПечатьРезультатИспытания.ПФ_MXL_МорскойРегистрСудоходства");
		
		СтруктураОбластей.Вставить("ОбластьШапка",         Макет.ПолучитьОбласть("ОбластьШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаШапка",  Макет.ПолучитьОбласть("ОбластьТаблицаШапка"));
		СтруктураОбластей.Вставить("ОбластьТаблицаСтрока", Макет.ПолучитьОбласть("ОбластьТаблицаСтрока"));
		СтруктураОбластей.Вставить("ОбластьТаблицаПодвал", Макет.ПолучитьОбласть("ОбластьТаблицаПодвал"));
		СтруктураОбластей.Вставить("ОбластьПодвал",        Макет.ПолучитьОбласть("ОбластьПодвал"));		
		Табдок.ПолеСлева  = 15;
		Табдок.ПолеСправа = 15;	
	КонецЕсли;
	//--Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
	
	Возврат СтруктураОбластей;
	
КонецФункции
//-- Гурьев 11.10.23

//++ Гурьев 11.10.23 ЧТЗ_К3
Функция ПолучитьДанныеПФ(Документ)
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. 
	//Если ТипЗНЧ(Документ) = Тип("ДокументСсылка.КАНАТ_СертификатКачества") Тогда
	//Документ = Документ.ДокументОснования;	
	//КонецЕсли;
	//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. 
	ДанныеПФ = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАНАТ_РезультатИспытаний.Номер КАК Номер,
	               |	КАНАТ_РезультатИспытаний.Дата КАК Дата,
	               |	КАНАТ_РезультатИспытаний.Цех КАК Цех,
	               |	КАНАТ_ЛицаПодписывающиеЗаПодразделения.РольРуководителя КАК РольРуководителя,
	               |	КАНАТ_ЛицаПодписывающиеЗаПодразделения.Сотрудник.Наименование КАК Сотрудник,
	               |	Номенклатура.НаименованиеПолное КАК ПродукцияПолноеНаименование,
	               |	КАНАТ_РезультатИспытаний.ПартияГотовойПродукции КАК Партия,
	               |	КАНАТ_РезультатИспытаний.НомерБухты КАК НомерБухты,
	               |	КАНАТ_РезультатИспытаний.Температура КАК Температура,
	               |	КАНАТ_РезультатИспытаний.ВлажностьФакт КАК ВлажностьФакт,
	               |	КАНАТ_РезультатИспытаний.ПрограммаИМетодикаИспытаний КАК ПрограммаИспытаний,
	               |	Номенклатура.Код КАК ПродукцияКод,
	               |	Номенклатура.НаименованиеПолное КАК ПродукцияНаименование,
	               |	КАНАТ_РезультатИспытаний.Оборудование КАК Оборудование,
	               |	КАНАТ_РезультатИспытаний.ЗаправочныеПараметры КАК ЗаправочныеПараметры,
	               |	КАНАТ_РезультатИспытаний.Структура КАК Структура,
	               |	КАНАТ_РезультатИспытаний.Результат КАК Результат,
	               |	КАНАТ_РезультатИспытаний.ДатаИзготовленияГотовойПродукции КАК ДатаИзготовления,
	               |	КАНАТ_РезультатИспытаний.МассаБухты КАК МассаПартии,
	               |	КАНАТ_РезультатИспытаний.Сорт КАК СортПеч,
	               |	КАНАТ_РезультатИспытаний.НомерСертификатаКачества КАК НомСертификатаКачества,
	               |	КАНАТ_РезультатИспытаний.СырьеДляПечатнойФормы КАК Сырье,
	               |	Номенклатура.Описание КАК ТекстовоеОписание
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения КАК КАНАТ_ЛицаПодписывающиеЗаПодразделения
	               |		ПО (КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаНачала <= КАНАТ_РезультатИспытаний.Дата)
	               |			И (КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаОкончания > КАНАТ_РезультатИспытаний.Дата)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО КАНАТ_РезультатИспытаний.Продукция = Номенклатура.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытаний.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КАНАТ_РезультатИспытанийСырье.Сырье.Код КАК Код,
	               |	КАНАТ_РезультатИспытанийСырье.Сырье.Наименование КАК Наименование,
	               |	КАНАТ_РезультатИспытанийСырье.ХарактеристикаСырья КАК Характеристика,
	               |	ХарактеристикиНоменклатуры.КАНАТ_НТДНоменклатуры КАК НТД
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний.Сырье КАК КАНАТ_РезультатИспытанийСырье
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ПО КАНАТ_РезультатИспытанийСырье.ХарактеристикаСырья = ХарактеристикиНоменклатуры.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытанийСырье.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Регистр КАК Регистр,
	               |	ВложенныйЗапрос.ДатаОдобрения КАК ДатаОдобрения,
	               |	КАНАТ_НТДНоменклатурыСписокСертификатов.Свидетельство КАК Свидетельство,
	               |	ВложенныйЗапрос.Регистр.Наименование КАК РегистрНаименование
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КАНАТ_НТДНоменклатурыСписокСертификатов.Регистр КАК Регистр,
	               |		МАКСИМУМ(КАНАТ_НТДНоменклатурыСписокСертификатов.ДатаОдобрения) КАК ДатаОдобрения
	               |	ИЗ
	               |		Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КАНАТ_НТДНоменклатуры.СписокСертификатов КАК КАНАТ_НТДНоменклатурыСписокСертификатов
	               |			ПО КАНАТ_РезультатИспытаний.НТДПродукции = КАНАТ_НТДНоменклатурыСписокСертификатов.Ссылка
	               |	ГДЕ
	               |		КАНАТ_НТДНоменклатурыСписокСертификатов.ДатаОдобрения <= КАНАТ_РезультатИспытаний.Дата
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		КАНАТ_НТДНоменклатурыСписокСертификатов.Регистр) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КАНАТ_НТДНоменклатуры.СписокСертификатов КАК КАНАТ_НТДНоменклатурыСписокСертификатов
	               |		ПО ВложенныйЗапрос.Регистр = КАНАТ_НТДНоменклатурыСписокСертификатов.Регистр
	               |			И ВложенныйЗапрос.ДатаОдобрения = КАНАТ_НТДНоменклатурыСписокСертификатов.ДатаОдобрения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КАНАТ_НТДНоменклатурыСписокСертификатов.Регистр,
	               |	ВложенныйЗапрос.Регистр,
	               |	ВложенныйЗапрос.ДатаОдобрения,
	               |	КАНАТ_НТДНоменклатурыСписокСертификатов.Свидетельство,
	               |	ВложенныйЗапрос.Регистр.Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//Данные печатной формы
	ВыборкаДанныеПФ = РезультатЗапроса[0].Выбрать();
	ДанныеШапкиЗаполнены = Ложь;
	
	Пока ВыборкаДанныеПФ.Следующий() Цикл
		
		Если Не ДанныеШапкиЗаполнены Тогда
			
			ДанныеПФ.Вставить("Номер",
							  ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ВыборкаДанныеПФ.Номер));
			ДанныеПФ.Вставить("НомСертификатаКачества",
							  ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Формат(ВыборкаДанныеПФ.НомСертификатаКачества, "ЧГ=0")));
			ДанныеПФ.Вставить("Дата",                        Формат(ВыборкаДанныеПФ.Дата, "ДФ=dd.MM.yyyy"));
			ДанныеПФ.Вставить("ДатаИзготовления",            Формат(ВыборкаДанныеПФ.ДатаИзготовления, "ДФ='MMММ yyyy'"));
			ДанныеПФ.Вставить("Цех",                         ВыборкаДанныеПФ.Цех);
	///++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
   ////ДанныеПФ.Вставить("ПродукцияПолноеНаименование", ВыборкаДанныеПФ.ПродукцияПолноеНаименование);
            Если не  ЗначениеЗаполнено(ВыборкаДанныеПФ.ТекстовоеОписание) Тогда
            ДанныеПФ.Вставить("ПродукцияПолноеНаименование", ВыборкаДанныеПФ.ПродукцияПолноеНаименование); 
            ДанныеПФ.Вставить("ПродукцияНаименование",       ВыборкаДанныеПФ.ПродукцияНаименование); 
            Иначе
            ДанныеПФ.Вставить("ПродукцияПолноеНаименование", ВыборкаДанныеПФ.ТекстовоеОписание); 
            ДанныеПФ.Вставить("ПродукцияНаименование",       ВыборкаДанныеПФ.ТекстовоеОписание);  
            конецЕсли;
   //--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
			
			
			
			ДанныеПФ.Вставить("Партия",                      ВыборкаДанныеПФ.Партия);
			ДанныеПФ.Вставить("НомерБухты",                  ВыборкаДанныеПФ.НомерБухты);
			ДанныеПФ.Вставить("Температура",                 ВыборкаДанныеПФ.Температура);
			ДанныеПФ.Вставить("ВлажностьФакт",               ВыборкаДанныеПФ.ВлажностьФакт);
			ДанныеПФ.Вставить("ПрограммаИспытаний",          ВыборкаДанныеПФ.ПрограммаИспытаний);
			ДанныеПФ.Вставить("ПродукцияКод",                ВыборкаДанныеПФ.ПродукцияКод);
			//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
			//ДанныеПФ.Вставить("ПродукцияНаименование",       ВыборкаДанныеПФ.ПродукцияНаименование);
			//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка
			ДанныеПФ.Вставить("Оборудование",                ВыборкаДанныеПФ.Оборудование);
			ДанныеПФ.Вставить("ЗаправочныеПараметры",        ВыборкаДанныеПФ.ЗаправочныеПараметры);
			ДанныеПФ.Вставить("Структура",                   ВыборкаДанныеПФ.Структура);
			ДанныеПФ.Вставить("МассаПартии",                 ВыборкаДанныеПФ.МассаПартии);
			ДанныеПФ.Вставить("СортПеч",                     ВыборкаДанныеПФ.СортПеч);
			ДанныеПФ.Вставить("Сырье",                       ВыборкаДанныеПФ.Сырье);
			Если ЗначениеЗаполнено(ВыборкаДанныеПФ.Результат) Тогда
				ДанныеПФ.Вставить("Результат",ВРег(Лев(ВыборкаДанныеПФ.Результат, 1)) + Прав(ВыборкаДанныеПФ.Результат, СтрДлина(ВыборкаДанныеПФ.Результат) - 1));
			КонецЕсли;
			
			ДанныеШапкиЗаполнены = Истина;
			
		КонецЕсли;
		
		Если ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.РуководительЛаборатории Тогда
			
			Попытка
				ДанныеПФ.Вставить("ЛабораторияРуководитель", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Имя руководителя лаборатории %1 записано не в формате ФИО.",
				//															ВыборкаДанныеПФ.Сотрудник));
				ДанныеПФ.Вставить("ЛабораторияРуководитель", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;

		ИначеЕсли ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.РуководительОУКП Тогда
			
			Попытка
				ДанныеПФ.Вставить("ОУКПРуководитель",        ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Имя руководителя ОУКП %1 записано не в формате ФИО.",
				//															ВыборкаДанныеПФ.Сотрудник));
				ДанныеПФ.Вставить("ОУКПРуководитель", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;

		ИначеЕсли ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.РуководительТехОтдела Тогда
			
			Попытка
				ДанныеПФ.Вставить("ТехОтделРуководитель",    ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Имя руководителя тех отдела %1 записано не в формате ФИО.",
				//															ВыборкаДанныеПФ.Сотрудник));
				ДанныеПФ.Вставить("ТехОтделРуководитель", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;
			
		ИначеЕсли ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.ТехникЛаборант Тогда
			
			Попытка
				ДанныеПФ.Вставить("ТехникЛаборант",    ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Имя руководителя тех отдела %1 записано не в формате ФИО.",
				//															ВыборкаДанныеПФ.Сотрудник));
				ДанныеПФ.Вставить("ТехникЛаборант", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;


		КонецЕсли;
		
	КонецЦикла;
	
	//Данные сырье
	//ВыборкаСырье = РезультатЗапроса[1].Выбрать();
	//Сырье = "";
	//
	//Пока ВыборкаСырье.Следующий() Цикл
	//	
	//	Сырье = Сырье + СтрШаблон("%1:%2 %3 %4;%5", 
	//							  ВыборкаСырье.Код,
	//							  ВыборкаСырье.Наименование,
	//							  ВыборкаСырье.НТД,
	//							  ВыборкаСырье.Характеристика,
	//							  Символы.ПС
	//							  );
	//	
	//КонецЦикла;
	
	//Данные о сертификатах
	ВыборкаСертификаты = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаСертификаты.Следующий() Цикл
		
		Если ВыборкаСертификаты.РегистрНаименование = "МЧС" Тогда
			
			ДанныеПФ.Вставить("НомерСертификатаМЧС", ВыборкаСертификаты.Свидетельство);
			
		ИначеЕсли ВыборкаСертификаты.РегистрНаименование = "РКО" Тогда
			
			ДанныеПФ.Вставить("НомерСП", ВыборкаСертификаты.Свидетельство);
			ДанныеПФ.Вставить("ДатаСП",  Формат(ВыборкаСертификаты.ДатаОдобрения, "ДФ=dd.MM.yyyy"));
			
		ИначеЕсли ВыборкаСертификаты.РегистрНаименование = "РМРС" Тогда
			
			ДанныеПФ.Вставить("НомерСТО", ВыборкаСертификаты.Свидетельство);
			ДанныеПФ.Вставить("ДатаСТО",  Формат(ВыборкаСертификаты.ДатаОдобрения, "ДФ=dd.MM.yyyy"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	//ДанныеПФ.Вставить("Сырье", Сырье);
	Попытка 
		ДанныеПФ.Вставить("Автор", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПользователиКлиентСервер.ТекущийПользователь()));
	Исключение
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Имя пользователя %1 записано не в формате ФИО.",
		//															ПользователиКлиентСервер.ТекущийПользователь()));
		ДанныеПФ.Вставить("Автор", ПользователиКлиентСервер.ТекущийПользователь());
	КонецПопытки;
	ДанныеПФ.Вставить("КолБухт", ?(ДанныеПФ.МассаПартии = 0, 0, 1));
	
	Возврат ДанныеПФ;
	
КонецФункции
//-- Гурьев 11.10.23 

//++ Гурьев 11.10.23 ЧТЗ_К3
Процедура ЗаполнитьВывестиТаблицуПоказателей(Табдок, Область, Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАНАТ_РезультатИспытанийРезультатИспытаний.Показатель КАК ПоказательНаименование,
	               |	КАНАТ_РезультатИспытанийРезультатИспытаний.ЕдИзм КАК ЕдИзмНаименование,
	               |	КАНАТ_РезультатИспытанийРезультатИспытаний.Норма КАК Норма,
	               |	КАНАТ_РезультатИспытанийРезультатИспытаний.ДопустимоеОтклонение КАК ДопустимоеОтклонение,
	               |	КАНАТ_РезультатИспытанийРезультатИспытаний.Факт КАК Факт
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний.РезультатИспытаний КАК КАНАТ_РезультатИспытанийРезультатИспытаний
	               |ГДЕ
	               |	КАНАТ_РезультатИспытанийРезультатИспытаний.Ссылка = &Ссылка
	               |	И КАНАТ_РезультатИспытанийРезультатИспытаний.ВыводитьВПФ = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Область.Параметры.Заполнить(Выборка);
		Табдок.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры
//-- Гурьев 11.10.23                                                   



//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. 
функция получитьДанныеСертефикатаКачества(Документ)
	ДанныеПФ = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КАНАТ_СертификатКачества.Номер КАК Номер,
		|	КАНАТ_СертификатКачества.Дата КАК Дата,
		|	КАНАТ_РезультатИспытаний.Цех КАК Цех,
		|	КАНАТ_ЛицаПодписывающиеЗаПодразделения.РольРуководителя КАК РольРуководителя,
		|	КАНАТ_ЛицаПодписывающиеЗаПодразделения.Сотрудник.Наименование КАК Сотрудник,
		|	Номенклатура.НаименованиеПолное КАК ПродукцияПолноеНаименование,
		|	КАНАТ_РезультатИспытаний.ПартияГотовойПродукции КАК Партия,
		|	КАНАТ_СертификатКачества.НомерБухты КАК НомерБухты,
		|	КАНАТ_РезультатИспытаний.Температура КАК Температура,
		|	КАНАТ_РезультатИспытаний.ВлажностьФакт КАК ВлажностьФакт,
		|	КАНАТ_РезультатИспытаний.ПрограммаИМетодикаИспытаний КАК ПрограммаИспытаний,
		|	Номенклатура.Код КАК ПродукцияКод,
		|	Номенклатура.НаименованиеПолное КАК ПродукцияНаименование,
		|	КАНАТ_РезультатИспытаний.Оборудование КАК Оборудование,
		|	КАНАТ_РезультатИспытаний.ЗаправочныеПараметры КАК ЗаправочныеПараметры,
		|	КАНАТ_РезультатИспытаний.Структура КАК Структура,
		|	КАНАТ_РезультатИспытаний.Результат КАК Результат,
		|	КАНАТ_СертификатКачества.ДатаИзготовленияГотовойПродукции КАК ДатаИзготовления,
		|	КАНАТ_СертификатКачества.МассаБухты КАК МассаПартии,
		|	КАНАТ_РезультатИспытаний.Сорт КАК СортПеч,
		|	КАНАТ_СертификатКачества.НомерСертификатаКачества КАК НомСертификатаКачества,
		|	КАНАТ_РезультатИспытаний.СырьеДляПечатнойФормы КАК Сырье,
		|	Номенклатура.Описание КАК ТекстовоеОписание
		|ИЗ
		|	Документ.КАНАТ_СертификатКачества КАК КАНАТ_СертификатКачества
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО КАНАТ_СертификатКачества.Продукция = Номенклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
		|		ПО КАНАТ_СертификатКачества.ДокументОснования = КАНАТ_РезультатИспытаний.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения КАК КАНАТ_ЛицаПодписывающиеЗаПодразделения
		|		ПО (КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаНачала <= КАНАТ_СертификатКачества.Дата)
		|			И (КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаОкончания > КАНАТ_СертификатКачества.Дата)
		|ГДЕ
		|	КАНАТ_СертификатКачества.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Регистр КАК Регистр,
		|	ВложенныйЗапрос.ДатаОдобрения КАК ДатаОдобрения,
		|	КАНАТ_НТДНоменклатурыСписокСертификатов.Свидетельство КАК Свидетельство,
		|	ВложенныйЗапрос.Регистр.Наименование КАК РегистрНаименование
		|ИЗ
		|	(ВЫБРАТЬ
		|		КАНАТ_НТДНоменклатурыСписокСертификатов.Регистр КАК Регистр,
		|		МАКСИМУМ(КАНАТ_НТДНоменклатурыСписокСертификатов.ДатаОдобрения) КАК ДатаОдобрения
		|	ИЗ
		|		Документ.КАНАТ_СертификатКачества КАК КАНАТ_СертификатКачества
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КАНАТ_НТДНоменклатуры.СписокСертификатов КАК КАНАТ_НТДНоменклатурыСписокСертификатов
		|				ПО КАНАТ_РезультатИспытаний.НТДПродукции = КАНАТ_НТДНоменклатурыСписокСертификатов.Ссылка
		|			ПО КАНАТ_СертификатКачества.ДокументОснования = КАНАТ_РезультатИспытаний.Ссылка
		|	ГДЕ
		|		КАНАТ_НТДНоменклатурыСписокСертификатов.ДатаОдобрения <= КАНАТ_РезультатИспытаний.Дата
		|	
		|	СГРУППИРОВАТЬ ПО
		|		КАНАТ_НТДНоменклатурыСписокСертификатов.Регистр) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КАНАТ_НТДНоменклатуры.СписокСертификатов КАК КАНАТ_НТДНоменклатурыСписокСертификатов
		|		ПО ВложенныйЗапрос.Регистр = КАНАТ_НТДНоменклатурыСписокСертификатов.Регистр
		|			И ВложенныйЗапрос.ДатаОдобрения = КАНАТ_НТДНоменклатурыСписокСертификатов.ДатаОдобрения";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныеПФ = РезультатЗапроса[0].Выбрать();
	ДанныеШапкиЗаполнены = Ложь;	
	Пока ВыборкаДанныеПФ.Следующий() Цикл	
		Если Не ДанныеШапкиЗаполнены Тогда	
			ДанныеПФ.Вставить("Номер",
							  ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ВыборкаДанныеПФ.Номер));
			ДанныеПФ.Вставить("НомСертификатаКачества",
							  ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Формат(ВыборкаДанныеПФ.НомСертификатаКачества, "ЧГ=0")));
			ДанныеПФ.Вставить("Дата",                        Формат(ВыборкаДанныеПФ.Дата, "ДФ=dd.MM.yyyy"));
			ДанныеПФ.Вставить("ДатаИзготовления",            Формат(ВыборкаДанныеПФ.ДатаИзготовления, "ДФ='MMММ yyyy'"));
			ДанныеПФ.Вставить("Цех",                         ВыборкаДанныеПФ.Цех);
			
			//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
			//ДанныеПФ.Вставить("ПродукцияПолноеНаименование", ВыборкаДанныеПФ.ПродукцияПолноеНаименование);
			Если не  ЗначениеЗаполнено(ВыборкаДанныеПФ.ТекстовоеОписание) Тогда
			ДанныеПФ.Вставить("ПродукцияПолноеНаименование", ВыборкаДанныеПФ.ПродукцияПолноеНаименование);	
			ДанныеПФ.Вставить("ПродукцияНаименование",       ВыборкаДанныеПФ.ПродукцияНаименование);	
			Иначе
			ДанныеПФ.Вставить("ПродукцияПолноеНаименование", ВыборкаДанныеПФ.ТекстовоеОписание);	
			ДанныеПФ.Вставить("ПродукцияНаименование",       ВыборкаДанныеПФ.ТекстовоеОписание);		
			 конецЕсли;
			//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
			
			ДанныеПФ.Вставить("Партия",                      ВыборкаДанныеПФ.Партия);
			ДанныеПФ.Вставить("НомерБухты",                  ВыборкаДанныеПФ.НомерБухты);
			ДанныеПФ.Вставить("Температура",                 ВыборкаДанныеПФ.Температура);
			ДанныеПФ.Вставить("ВлажностьФакт",               ВыборкаДанныеПФ.ВлажностьФакт);
			ДанныеПФ.Вставить("ПрограммаИспытаний",          ВыборкаДанныеПФ.ПрограммаИспытаний);
			ДанныеПФ.Вставить("ПродукцияКод",                ВыборкаДанныеПФ.ПродукцияКод);
			
			//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.	
			//ДанныеПФ.Вставить("ПродукцияНаименование",       ВыборкаДанныеПФ.ПродукцияНаименование);
			
			
			//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
			
			ДанныеПФ.Вставить("Оборудование",                ВыборкаДанныеПФ.Оборудование);
			ДанныеПФ.Вставить("ЗаправочныеПараметры",        ВыборкаДанныеПФ.ЗаправочныеПараметры);
			ДанныеПФ.Вставить("Структура",                   ВыборкаДанныеПФ.Структура);
			ДанныеПФ.Вставить("МассаПартии",                 ВыборкаДанныеПФ.МассаПартии);
			ДанныеПФ.Вставить("СортПеч",                     ВыборкаДанныеПФ.СортПеч);
			ДанныеПФ.Вставить("Сырье",                       ВыборкаДанныеПФ.Сырье);
			Если ЗначениеЗаполнено(ВыборкаДанныеПФ.Результат) Тогда
				ДанныеПФ.Вставить("Результат",ВРег(Лев(ВыборкаДанныеПФ.Результат, 1)) + Прав(ВыборкаДанныеПФ.Результат, СтрДлина(ВыборкаДанныеПФ.Результат) - 1));
			КонецЕсли;
			
			ДанныеШапкиЗаполнены = Истина;
			
		КонецЕсли;
		
	   		Если ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.РуководительЛаборатории Тогда
			
			Попытка
				ДанныеПФ.Вставить("ЛабораторияРуководитель", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				ДанныеПФ.Вставить("ЛабораторияРуководитель", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;

		ИначеЕсли ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.РуководительОУКП Тогда
			
			Попытка
				ДанныеПФ.Вставить("ОУКПРуководитель",        ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				ДанныеПФ.Вставить("ОУКПРуководитель", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;

		ИначеЕсли ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.РуководительТехОтдела Тогда
			
			Попытка
				ДанныеПФ.Вставить("ТехОтделРуководитель",    ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				ДанныеПФ.Вставить("ТехОтделРуководитель", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;
			
		ИначеЕсли ВыборкаДанныеПФ.РольРуководителя = Перечисления.КАНАТ_РолиПодписантов.ТехникЛаборант Тогда
			
			Попытка
				ДанныеПФ.Вставить("ТехникЛаборант",    ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДанныеПФ.Сотрудник));
			Исключение
				ДанныеПФ.Вставить("ТехникЛаборант", ВыборкаДанныеПФ.Сотрудник);
			КонецПопытки;


		КонецЕсли;
		
	КонецЦикла;
	//	
	////Данные о сертификатах
	ВыборкаСертификаты = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаСертификаты.Следующий() Цикл
		
		Если ВыборкаСертификаты.РегистрНаименование = "МЧС" Тогда
			
			ДанныеПФ.Вставить("НомерСертификатаМЧС", ВыборкаСертификаты.Свидетельство);
			
		ИначеЕсли ВыборкаСертификаты.РегистрНаименование = "РКО" Тогда
			
			ДанныеПФ.Вставить("НомерСП", ВыборкаСертификаты.Свидетельство);
			ДанныеПФ.Вставить("ДатаСП",  Формат(ВыборкаСертификаты.ДатаОдобрения, "ДФ=dd.MM.yyyy"));
			
		ИначеЕсли ВыборкаСертификаты.РегистрНаименование = "РМРС" Тогда
			
			ДанныеПФ.Вставить("НомерСТО", ВыборкаСертификаты.Свидетельство);
			ДанныеПФ.Вставить("ДатаСТО",  Формат(ВыборкаСертификаты.ДатаОдобрения, "ДФ=dd.MM.yyyy"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка 
		ДанныеПФ.Вставить("Автор", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПользователиКлиентСервер.ТекущийПользователь()));
	Исключение
		ДанныеПФ.Вставить("Автор", ПользователиКлиентСервер.ТекущийПользователь());
	КонецПопытки;
	ДанныеПФ.Вставить("КолБухт", ?(ДанныеПФ.МассаПартии = 0, 0, 1));
	
	Возврат ДанныеПФ;

	
конецФункции

Процедура ЗаполнитьВывестиТаблицуПоказателейСертефикатКачества(Табдок, Область, Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАНАТ_СертификатКачестваРезультатИспытаний.Показатель КАК ПоказательНаименование,
	               |	КАНАТ_СертификатКачестваРезультатИспытаний.ЕдИзм КАК ЕдИзмНаименование,
	               |	КАНАТ_СертификатКачестваРезультатИспытаний.Норма КАК Норма,
	               |	КАНАТ_СертификатКачестваРезультатИспытаний.ДопустимоеОтклонение КАК ДопустимоеОтклонение,
	               |	КАНАТ_СертификатКачестваРезультатИспытаний.Факт КАК Факт
	               |ИЗ
	               |	Документ.КАНАТ_СертификатКачества.РезультатИспытаний КАК КАНАТ_СертификатКачестваРезультатИспытаний
	               |ГДЕ
	               |	КАНАТ_СертификатКачестваРезультатИспытаний.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Область.Параметры.Заполнить(Выборка);
		Табдок.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры


//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
